
## Terraform Plan 📖
<details>
<summary>Click to expand</summary>

```HCL

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.master_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk                  = (known after apply)
      ~ clone                     = "packer-debian-13.2.0-20251125093807" -> "packer-debian-13.2.0-20251125100933" # forces replacement
      - cores                     = 0 -> null
      ~ current_node              = "pve" -> (known after apply)
      ~ default_ipv4_address      = "10.9.9.50" -> (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "pve/qemu/200" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
        name                      = "kube-master-01"
      - numa                      = false -> null
      - qemu_os                   = "l26" -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      ~ ssh_host                  = "10.9.9.50" -> (known after apply)
      ~ ssh_port                  = "22" -> (known after apply)
      ~ sshkeys                   = (sensitive value)
      ~ tags                      = "k3s;master" -> "k3s,master"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
        # (40 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:4d:99:92" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:7a:fd:06" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "99be6878-777e-4f0d-86e4-c527453d4c51" -> null
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.worker_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk                  = (known after apply)
      ~ clone                     = "packer-debian-13.2.0-20251125093807" -> "packer-debian-13.2.0-20251125100933" # forces replacement
      - cores                     = 0 -> null
      ~ current_node              = "pve" -> (known after apply)
      ~ default_ipv4_address      = "10.9.9.51" -> (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "pve/qemu/201" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
        name                      = "kube-worker-01"
      - numa                      = false -> null
      - qemu_os                   = "l26" -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      ~ ssh_host                  = "10.9.9.51" -> (known after apply)
      ~ ssh_port                  = "22" -> (known after apply)
      ~ sshkeys                   = (sensitive value)
      ~ tags                      = "k3s;worker" -> "k3s,worker"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
        # (40 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:cf:64:14" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:f7:da:45" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "dde4dccf-cdf3-4aee-8154-6dc682a4a2db" -> null
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.worker_nodes[1].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk                  = (known after apply)
      ~ clone                     = "packer-debian-13.2.0-20251125093807" -> "packer-debian-13.2.0-20251125100933" # forces replacement
      - cores                     = 0 -> null
      ~ current_node              = "pve" -> (known after apply)
      ~ default_ipv4_address      = "10.9.9.52" -> (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "pve/qemu/202" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
        name                      = "kube-worker-02"
      - numa                      = false -> null
      - qemu_os                   = "l26" -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      ~ ssh_host                  = "10.9.9.52" -> (known after apply)
      ~ ssh_port                  = "22" -> (known after apply)
      ~ sshkeys                   = (sensitive value)
      ~ tags                      = "k3s;worker" -> "k3s,worker"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
        # (40 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:6f:84:8e" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:b0:cc:0e" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "a0564ad8-be1c-4d28-9b3e-0a1bce632d5c" -> null
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>

*Pusher: @MrStarktastic, Action: `pull_request`*